data/perf/campaign-f3deebfbab60/flag-mysql/mysql/tsan/warmup1/oltp_write_only.txt
Sysbench script: /usr/share/sysbench/oltp_write_only.lua
sysbench /usr/share/sysbench/oltp_write_only.lua --mysql-user=root --mysql-socket=/tmp/mysql.sock  --threads=36 --time=180 --rand-type=special run | awk '/Latency \(ms\):/ { exit; } 1'
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 36
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           86682
        other:                           43417
        total:                           130099
    transactions:                        21587  (119.72 per sec.)
    queries:                             130099 (721.53 per sec.)
    ignored errors:                      243    (1.35 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          180.3065s
    total number of events:              21587

MySQL build: ..